In [45]:
import pandas as pd

In [46]:
# Loding RAW Dataset 

df = pd.read_csv("../data/RAW_data.csv")

In [47]:
df.head() # First Rows

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner,mileage,engine,max_power,torque,seats
0,Maruti Swift Dzire VDI,2014,450000,145500,Diesel,Individual,Manual,First Owner,23.4 kmpl,1248 CC,74 bhp,190Nm@ 2000rpm,5.0
1,Skoda Rapid 1.5 TDI Ambition,2014,370000,120000,Diesel,Individual,Manual,Second Owner,21.14 kmpl,1498 CC,103.52 bhp,250Nm@ 1500-2500rpm,5.0
2,Honda City 2017-2020 EXi,2006,158000,140000,Petrol,Individual,Manual,Third Owner,17.7 kmpl,1497 CC,78 bhp,"12.7@ 2,700(kgm@ rpm)",5.0
3,Hyundai i20 Sportz Diesel,2010,225000,127000,Diesel,Individual,Manual,First Owner,23.0 kmpl,1396 CC,90 bhp,22.4 kgm at 1750-2750rpm,5.0
4,Maruti Swift VXI BSIII,2007,130000,120000,Petrol,Individual,Manual,First Owner,16.1 kmpl,1298 CC,88.2 bhp,"11.5@ 4,500(kgm@ rpm)",5.0

In [48]:
print( df.shape ) # Checking Rows and cols 

print( df.columns )  # Checking cols names

(8128, 13)
Index(['name', 'year', 'selling_price', 'km_driven', 'fuel', 'seller_type',
       'transmission', 'owner', 'mileage', 'engine', 'max_power', 'torque',
       'seats'],
      dtype='str')

In [49]:
df.info()  # Check Datatypes + Null info

<class 'pandas.DataFrame'>
RangeIndex: 8128 entries, 0 to 8127
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           8128 non-null   str
 1   year           8128 non-null   int64
 2   selling_price  8128 non-null   int64
 3   km_driven      8128 non-null   int64
 4   fuel           8128 non-null   str
 5   seller_type    8128 non-null   str
 6   transmission   8128 non-null   str
 7   owner          8128 non-null   str
 8   mileage        7907 non-null   str
 9   engine         7907 non-null   str
 10  max_power      7913 non-null   str
 11  torque         7906 non-null   str
 12  seats          7907 non-null   float64
dtypes: float64(1), int64(3), str(9)
memory usage: 825.6 KB

In [50]:
df.isnull().sum() #Use to check Missing Values

name               0
year               0
selling_price      0
km_driven          0
fuel               0
seller_type        0
transmission       0
owner              0
mileage          221
engine           221
max_power        215
torque           222
seats            221
dtype: int64

In [51]:
df.duplicated().sum()  # Using to check Duplicate Rows 

# print(df.dtypes)

np.int64(1202)

In [52]:
# dataset has 1,202 rows that are exact copies of other rows.

df = df.drop_duplicates()  # Removing  the Duplicate Rows

In [53]:
df.duplicated().sum() # chacking
df.shape

(6926, 13)

In [54]:
df.isnull().sum()   # Chacking Null values

name               0
year               0
selling_price      0
km_driven          0
fuel               0
seller_type        0
transmission       0
owner              0
mileage          208
engine           208
max_power        205
torque           209
seats            208
dtype: int64

In [55]:
df = df.dropna() # Removes the Rows with Null values

In [65]:
df.shape

df.dtypes

name                 str
year               int64
selling_price      int64
km_driven          int64
fuel                 str
seller_type          str
transmission         str
owner                str
mileage              str
engine               str
max_power        float64
torque           float64
seats            float64
dtype: object

In [66]:
# df['mileage'] = df['mileage'].str.split().str[0]
# df['mileage'] = df['mileage'].astype(float)

# Clean engine
# df['engine'] = df['engine'].str.split().str[0]
# df['engine'] = df['engine'].astype(float)

# # Clean max_power
# df['max_power'] = df['max_power'].str.split().str[0]
# df['max_power'] = df['max_power'].astype(float)

# # Clean torque
# df['torque'] = df['torque'].str.split().str[0]
# df['torque'] = df['torque'].astype(float)


# Clean mileage
df['mileage'] = df['mileage'].str.split().str[0]
df['mileage'] = df['mileage'].astype(float)

# Clean engine
df['engine'] = df['engine'].str.split().str[0]
df['engine'] = df['engine'].astype(float)

In [ ]:
# from datetime import datetime

# current_year = datetime.now().year
# df['car_age'] = current_year - df['year']

df[['year','car_age']].head()

   year  car_age
0  2014       12
1  2014       12
2  2006       20
3  2010       16
4  2007       19

In [ ]:
# df['depreciation_per_year'] = df['selling_price'] / df['car_age']

df[['selling_price','car_age','depreciation_per_year']].head()

   selling_price  car_age  depreciation_per_year
0         450000       12           37500.000000
1         370000       12           30833.333333
2         158000       20            7900.000000
3         225000       16           14062.500000
4         130000       19            6842.105263

In [ ]:
# def price_category(price):
#     if price < 300000:
#         return "Budget"
#     elif price < 700000:
#         return "Mid"
#     else:
#         return "Premium"

# df['price_category'] = df['selling_price'].apply(price_category)


df[['selling_price','price_category']].head()

   selling_price price_category
0         450000            Mid
1         370000            Mid
2         158000         Budget
3         225000         Budget
4         130000         Budget

In [68]:

# from sklearn.preprocessing import MinMaxScaler

# scaler = MinMaxScaler()

# columns_to_scale = [
#     'selling_price',
#     'km_driven',
#     'engine',
#     'max_power',
#     'mileage',
#     'torque'
# ]

# df[columns_to_scale] = scaler.fit_transform(df[columns_to_scale])


df[columns_to_scale].head()

   selling_price  km_driven    engine  max_power   mileage    torque
0       0.042126   0.061640  0.209396   0.112200  0.557143  0.236943
1       0.034102   0.050837  0.293289   0.192593  0.503333  0.313376
2       0.012839   0.059310  0.292953   0.123094  0.421429  0.010191
3       0.019559   0.053803  0.259060   0.155773  0.547619  0.022930
4       0.010030   0.050837  0.226174   0.150871  0.383333  0.008917

In [69]:
df.to_csv("../data/cleaned_data.csv", index=False)